nxp-mcuxpresso/mcuxsdk-examples/_boards/mc56f80000evk/demo_apps/mc_pmsm/pmsm_snsless/pin_mux.h
/*
    * Copyright 2024 NXP
    *
    * SPDX-License-Identifier: BSD-3-Clause
*/

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitQSCI(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitGPIO(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPWMA(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitADC(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_CMPC(void);

/*! @name GPIOC0 (number 3), EXTAL
  @{ */
#define BOARD_OCCS_EXTAL_GPIO GPIOC          /*!<@brief GPIO device name: GPIOC */
#define BOARD_OCCS_EXTAL_PIN 0U              /*!<@brief GPIOC pin index: 0 */
#define BOARD_OCCS_EXTAL_PIN_MASK kGPIO_Pin0 /*!<@brief PORT pin mask */
                                             /* @} */

/*! @name GPIOC1 (number 4), XTAL
  @{ */
#define BOARD_OCCS_XTAL_GPIO GPIOC          /*!<@brief GPIO device name: GPIOC */
#define BOARD_OCCS_XTAL_PIN 1U              /*!<@brief GPIOC pin index: 1 */
#define BOARD_OCCS_XTAL_PIN_MASK kGPIO_Pin1 /*!<@brief PORT pin mask */
                                            /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_OCCS(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
